signed.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rem="http://remote.cdv.procergs.com/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#"><soapenv:Header/><soapenv:Body><rem:pesquisarEstoqueGid><PESQUISAR_ESTOQUE Id="CDV"><infPesquisarEstoque><CDV><COD_CREDENCIADO>CDV00659</COD_CREDENCIADO><CNPJ_CREDENCIADO>01418977000277</CNPJ_CREDENCIADO><COD_AMBIENTE>1</COD_AMBIENTE><MATR_OPER>0</MATR_OPER><VERSAO_LEIAUTE>1</VERSAO_LEIAUTE><NOME_EMISSOR_NFE>GESCOM</NOME_EMISSOR_NFE><CNPJ_EMISSOR_NFE>15254156000176</CNPJ_EMISSOR_NFE></CDV><PLACA_VEICULO>DGU2533</PLACA_VEICULO><ULTIMO_ITEM_PESQUISADO>0</ULTIMO_ITEM_PESQUISADO></infPesquisarEstoque><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#CDV"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>YXmqAKc0RzFp5ZgSMdhibPuvQxQ=</DigestValue></Reference></SignedInfo><SignatureValue>TZqFsRH2QppaBQ3Vgjj7FPxRxdmhDqnIcqYscC5faProfTRxjuX1AoNUtS3IN4G4MIlzYgkPJ8dJJ/4mH+cMQ3X+YwCRk037mgQCQrfYoI7p9jYlM1zRv6482XidWbD/vHu/qpgODdNo6M5cUrPkvO8D2xM1haDc90/nftIzY7THV9/oycURhII2gfR7ayz+ZoN2ihXxYfobQ8YX4QTE6xsd2w8Ru0xq1uL7QJvZbbE0vc3h9RWqOIxrOB2Uvl7wVj4YcxApbYAElZ0a7b9Tt64O/te5wQrgSkr6Iw/cy34W67bsS2JW9x2xLyo7q+Qi2sXQC9iZukgZF4XZEXGvFw==</SignatureValue><KeyInfo><X509Data/></KeyInfo></Signature></PESQUISAR_ESTOQUE></rem:pesquisarEstoqueGid></soapenv:Body></soapenv:Envelope>